# St7GetSRALoadExcitation

Returns the status of the Load Excitation setting for Spectral Response analysis.

long St7GetSRALoadExcitation(long uID, bool* Load)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
Load
True if Load Excitation cases are included.